[
    {
        "id": 1,
        "employee_id": 12345,
        "employee_name": "John Doe",
        "position": "Senior Software Engineer",
        "testimonial_text": "Working at XYZ Company has been an amazing experience. The collaborative and innovative environment here has truly enhanced my professional growth. I appreciate the support from my colleagues and the management team. The opportunities for skill development and the emphasis on work-life balance make XYZ Company an outstanding workplace.",
        "rating": 5,
        "date": "2023-11-24"
    },
    {
        "id": 2,
        "employee_id": 67890,
        "employee_name": "Jane Smith",
        "position": "Marketing Specialist",
        "testimonial_text": "I've had the pleasure of being part of the XYZ Company for the past three years. The dynamic and inclusive culture has made a significant impact on my career. The encouragement to think creatively and the constant learning opportunities are what set this company apart. I highly recommend XYZ Company to anyone looking for a vibrant and supportive work environment.",
        "rating": 4,
        "date": "2023-11-25"
    },
    {
        "id": 3,
        "employee_id": 54321,
        "employee_name": "Alex Johnson",
        "position": "HR Manager",
        "testimonial_text": "XYZ Company values its employees like no other. As an HR manager, I've witnessed the commitment to employee well-being firsthand. The benefits package, professional development initiatives, and the emphasis on diversity and inclusion make XYZ Company a fantastic place to work. Proud to be part of this organization!",
        "rating": 5,
        "date": "2023-11-26"
    },
    {
        "id": 4,
        "employee_id": 98765,
        "employee_name": "Emily Davis",
        "position": "Financial Analyst",
        "testimonial_text": "Choosing XYZ Company for my career was one of the best decisions I've made. The leadership team is approachable, and the work environment fosters collaboration. The company's commitment to staying at the forefront of industry trends and providing employees with the tools they need for success makes it a top-notch workplace.",
        "rating": 4,
        "date": "2023-11-27"
    }
]